package org.lwjgl;

import java.io.File;
import java.lang.reflect.Field;
import java.lang.reflect.Method;
import java.nio.ByteBuffer;
import java.security.AccessController;
import java.security.PrivilegedAction;
import java.security.PrivilegedActionException;
import java.security.PrivilegedExceptionAction;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;
import java.util.StringTokenizer;

public class LWJGLUtil {
   public static final int PLATFORM_LINUX = 1;
   public static final int PLATFORM_MACOSX = 2;
   public static final int PLATFORM_WINDOWS = 3;
   public static final String PLATFORM_LINUX_NAME = "linux";
   public static final String PLATFORM_MACOSX_NAME = "macosx";
   public static final String PLATFORM_WINDOWS_NAME = "windows";
   private static final String LWJGL_ICON_DATA_16x16 = "ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿÿÂ×èÿt¤ËÿP\u008b½ÿT\u008e¿ÿ\u0086¯Òÿçïöÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿõõõÿ\u008d\u008f\u0091ÿv\u0082\u008dÿ}\u008d\u009bÿ\u0084\u0099ªÿ\u0094·Õÿ:}µÿH\u0086ºÿÚçñÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿôøûÿ\u009c\u009e ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿäääÿ\u0084\u00adÐÿ:}µÿ[\u0092Áÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0091¶Õÿ___ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\"\"\"ÿÿÿÿÿèðöÿ9|µÿ:}µÿÄØéÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÆÙéÿ\u0081«Îÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿfffÿÿÿÿÿÐàíÿ:}µÿ:}µÿ\u008d´Ôÿÿÿÿÿòòòÿ¥¥¥ÿßßßÿ¢ÁÜÿ°ÅÖÿ\n\n\nÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ¨¨¨ÿÿÿÿÿ\u0097ºØÿ:}µÿ:}µÿq¡Êÿÿÿÿÿ¡¡¡ÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿ###ÿÌÌÌÿÐÐÐÿ¥¥¥ÿ\u0084\u0084\u0084ÿ\\\\\\ÿïïïÿÿÿÿÿ`\u0096Ãÿ:}µÿ:}µÿm\u009eÈÿÿÿÿÿ^^^ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÏÏÏÿ\u001f\u001f\u001fÿ\u0003\u0003\u0003ÿ+++ÿlllÿÆÆÆÿúüýÿ\u009e¿Úÿw¥ÌÿL\u0089¼ÿ|¨Îÿÿÿÿÿ\u001b\u001b\u001bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0017\u0017\u0017ÿÖÖÖÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿRRRÿåååÿ===ÿhhhÿ¦¦§ÿÚÞáÿÿÿÿÿtttÿ\u000e\u000e\u000eÿ\u0000\u0000\u0000ÿYYYÿ\u0095\u0095\u0095ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0091\u0091\u0091ÿ\u009b\u009b\u009bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿCCCÿÿÿÿÿîîîÿ\u008c\u008c\u008cÿ¿¿¿ÿVVVÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÓÓÓÿXXXÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ333ÿÿÿÿÿÿÿÿÿüýþÿÿÿÿÿÀÀÀÿ@@@ÿ\u0002\u0002\u0002ÿ\u0000\u0000\u0000ÿ\u001b\u001b\u001bÿûûûÿ\u0017\u0017\u0017ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿxxxÿÿÿÿÿÿÿÿÿÒáîÿ~©ÎÿàêóÿÿÿÿÿÔÔÔÿmmmÿ\u0084\u0084\u0084ÿÓÓÓÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ½½½ÿÿÿÿÿÿÿÿÿþþþÿf\u009aÅÿ=\u007f¶ÿ\u0082¬Ðÿäíõÿÿÿÿÿÿÿÿÿåååÿ---ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\f\f\fÿöööÿÿÿÿÿÿÿÿÿÿÿÿÿâìôÿM\u0089¼ÿ:}µÿ>\u0080¶ÿ\u0087°Òÿçïöÿÿÿÿÿþþþÿ¼¼¼ÿOOOÿ\u0003\u0003\u0003ÿJJJÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿëòøÿ\u008c³ÔÿV\u0090ÀÿP\u008c½ÿw¥Ìÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿæææÿÿÿÿÿ";
   private static final String LWJGL_ICON_DATA_32x32 = "ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúüýÿËÝìÿ\u0093·Öÿo Éÿ\\\u0093Âÿ`\u0096Ãÿz§Íÿ¬ÈàÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüýþÿµÎãÿZ\u0092Áÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿE\u0085¹ÿ¡ÁÜÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüüüÿâêñÿ¸Ïãÿ®Éàÿ£ÂÜÿ\u0098ºØÿ\u008c³Óÿ\u0081¬Ïÿn\u009fÈÿ=\u007f¶ÿ:}µÿ:}µÿ:}µÿr¢ÊÿõøûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿØØØÿ111ÿ$$$ÿ111ÿ@@@ÿRRRÿeeeÿtttÿ\u008f\u008f\u008fÿ÷øøÿ¬Èßÿ;}µÿ:}µÿ:}µÿ:}µÿy§Íÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿhhhÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ¶¶¶ÿþþþÿ\u0086®Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ®ÊáÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÓâîÿáêòÿ(((ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿÞÞÞÿÿÿÿÿõøûÿ[\u0092Áÿ:}µÿ:}µÿ:}µÿH\u0086ºÿôøûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿìóøÿd\u0099Åÿ×ÙÛÿ\u0005\u0005\u0005ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ$$$ÿþþþÿÿÿÿÿÿÿÿÿÀÕçÿ9|µÿ:}µÿ:}µÿ:}µÿ«Èàÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿÿx¦Ìÿ{§Íÿ\u009e\u009e\u009eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿeeeÿÿÿÿÿÿÿÿÿÿÿÿÿâìôÿ7{´ÿ:}µÿ:}µÿ:}µÿf\u009aÅÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÃ×èÿ9}µÿ²ÌáÿXXXÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ©©©ÿÿÿÿÿÿÿÿÿÿÿÿÿ¼Òåÿ:}µÿ:}µÿ:}µÿ:}µÿ@\u0081·ÿîôùÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúüýÿZ\u0092Áÿ=\u007f¶ÿÝåíÿ\u001c\u001c\u001cÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0007\u0007\u0007ÿçççÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0085®Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ9}µÿÌÞìÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÿÿÿÿÿÿÿÿÿÿÿÿºÒåÿ:}µÿW\u0090¿ÿÐÑÑÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ333ÿýýýÿÿÿÿÿÿÿÿÿûüýÿP\u008b½ÿ:}µÿ:}µÿ:}µÿ:}µÿ9}µÿ±ÌâÿÿÿÿÿÿÿÿÿÿÿÿÿÊÊÊÿ777ÿaaaÿ¢¢¢ÿÝÝÝÿäìóÿ±Ëáÿ´Íâÿæææÿ###ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿrrrÿÿÿÿÿÿÿÿÿÿÿÿÿØåðÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ ÀÛÿÿÿÿÿÿÿÿÿÿÿÿÿfffÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0006\u0006\u0006ÿ'''ÿfffÿÔÔÔÿÿÿÿÿöööÿÐÐÐÿ\u0097\u0097\u0097ÿ^^^ÿ'''ÿ\u0004\u0004\u0004ÿ\u0000\u0000\u0000ÿ\u0003\u0003\u0003ÿÀÀÀÿÿÿÿÿÿÿÿÿÿÿÿÿ¢ÁÛÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ\u009e¿Úÿÿÿÿÿÿÿÿÿûûûÿ%%%ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\\\\\\ÿÿÿÿÿêêêÿ\u008f\u008f\u008fÿµµµÿéééÿýýýÿçççÿ²²²ÿ½½½ÿþþþÿÿÿÿÿÿÿÿÿÿÿÿÿk\u009dÇÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ¡ÁÜÿÿÿÿÿÿÿÿÿÛÛÛÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0083\u0083\u0083ÿÿÿÿÿ___ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u000b\u000b\u000bÿ777ÿvvvÿ···ÿðððÿÿÿÿÿÿÿÿÿÿÿÿÿðõùÿK\u0088»ÿ=\u007f¶ÿ9|µÿ:}µÿ:}µÿ:}µÿ:}µÿ²Ìâÿÿÿÿÿÿÿÿÿ\u009a\u009a\u009aÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÅÅÅÿ÷÷÷ÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0007\u0007\u0007ÿ<<<ÿßßßÿÿÿÿÿûüýÿüýþÿó÷úÿÌÝëÿ\u009e¾Úÿr¡ÉÿL\u0089»ÿ:}µÿÉÜëÿÿÿÿÿÿÿÿÿVVVÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u000f\u000f\u000fÿùùùÿÑÑÑÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u008e\u008e\u008eÿÿÿÿÿùùùÿ\u0084\u0084\u0084ÿpppÿ°°°ÿêêêÿÿÿÿÿùûüÿÜèòÿöùüÿÿÿÿÿÿÿÿÿ\u0015\u0015\u0015ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿNNNÿÿÿÿÿ\u0091\u0091\u0091ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ»»»ÿÿÿÿÿ\u009e\u009e\u009eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0004\u0004\u0004ÿ///ÿpppÿ°°°ÿæææÿþþþÿÿÿÿÿ999ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0090\u0090\u0090ÿÿÿÿÿMMMÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0010\u0010\u0010ÿðððÿÿÿÿÿZZZÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\t\t\tÿ222ÿ±±±ÿöööÿ¡¡¡ÿ555ÿ\u0002\u0002\u0002ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿÑÑÑÿõõõÿ\u0013\u0013\u0013ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿEEEÿþþþÿøøøÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ+++ÿÿÿÿÿÿÿÿÿüüüÿ¾¾¾ÿPPPÿ\u0005\u0005\u0005ÿ%%%ÿùùùÿÂÂÂÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0086\u0086\u0086ÿÿÿÿÿÒÒÒÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿCCCÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÜÜÜÿàààÿÿÿÿÿ\u0095\u0095\u0095ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿÈÈÈÿÿÿÿÿ\u008e\u008e\u008eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0088\u0088\u0088ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿ)))ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0018\u0018\u0018ÿõõõÿÿÿÿÿJJJÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÏÏÏÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿñöúÿÿÿÿÿÿÿÿÿÿÿÿÿùùùÿµµµÿKKKÿ\u0006\u0006\u0006ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿRRRÿÿÿÿÿøøøÿ\u0010\u0010\u0010ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u001c\u001c\u001cÿøøøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0086¯Ñÿ\u0090µÕÿêñ÷ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÿxxxÿ\u001b\u001b\u001bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0096\u0096\u0096ÿÿÿÿÿÆÆÆÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿZZZÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÃØéÿ:}µÿC\u0083¸ÿ\u0094¸Öÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿôôôÿ§§§ÿ\u0085\u0085\u0085ÿôôôÿÿÿÿÿ\u0086\u0086\u0086ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u009d\u009d\u009dÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúûýÿ]\u0094Âÿ:}µÿ:}µÿF\u0085¹ÿ\u0098»Øÿïôùÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u009b\u009b\u009bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0005\u0005\u0005ÿÝÝÝÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÅÙéÿ;~¶ÿ:}µÿ:}µÿ:}µÿH\u0086ºÿ\u009e¾Úÿòöúÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿûûûÿ\u008e\u008e\u008eÿ%%%ÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ,,,ÿüüüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u008fµÕÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿJ\u0087»ÿ£ÂÜÿó÷úÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúúúÿ°°°ÿEEEÿ\u0004\u0004\u0004ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿnnnÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüýþÿ\u0085¯Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿM\u0089¼ÿ¨ÅÞÿöùüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÒÒÒÿhhhÿ\u000e\u000e\u000eÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿ¸¸¸ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþÿÿ±ËâÿL\u0089¼ÿ9}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿM\u0089¼ÿ¿Ôçÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿìììÿ\u0093\u0093\u0093ÿ\u009b\u009b\u009bÿýýýÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿó÷úÿµÎãÿ\u0081¬Ðÿe\u0099Åÿa\u0097Äÿl\u009eÈÿ\u008fµÕÿÅÙéÿ÷úüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ";
   public static final ByteBuffer LWJGLIcon16x16 = loadIcon("ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿÿÂ×èÿt¤ËÿP\u008b½ÿT\u008e¿ÿ\u0086¯Òÿçïöÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿõõõÿ\u008d\u008f\u0091ÿv\u0082\u008dÿ}\u008d\u009bÿ\u0084\u0099ªÿ\u0094·Õÿ:}µÿH\u0086ºÿÚçñÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿôøûÿ\u009c\u009e ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿäääÿ\u0084\u00adÐÿ:}µÿ[\u0092Áÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0091¶Õÿ___ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\"\"\"ÿÿÿÿÿèðöÿ9|µÿ:}µÿÄØéÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÆÙéÿ\u0081«Îÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿfffÿÿÿÿÿÐàíÿ:}µÿ:}µÿ\u008d´Ôÿÿÿÿÿòòòÿ¥¥¥ÿßßßÿ¢ÁÜÿ°ÅÖÿ\n\n\nÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ¨¨¨ÿÿÿÿÿ\u0097ºØÿ:}µÿ:}µÿq¡Êÿÿÿÿÿ¡¡¡ÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿ###ÿÌÌÌÿÐÐÐÿ¥¥¥ÿ\u0084\u0084\u0084ÿ\\\\\\ÿïïïÿÿÿÿÿ`\u0096Ãÿ:}µÿ:}µÿm\u009eÈÿÿÿÿÿ^^^ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÏÏÏÿ\u001f\u001f\u001fÿ\u0003\u0003\u0003ÿ+++ÿlllÿÆÆÆÿúüýÿ\u009e¿Úÿw¥ÌÿL\u0089¼ÿ|¨Îÿÿÿÿÿ\u001b\u001b\u001bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0017\u0017\u0017ÿÖÖÖÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿRRRÿåååÿ===ÿhhhÿ¦¦§ÿÚÞáÿÿÿÿÿtttÿ\u000e\u000e\u000eÿ\u0000\u0000\u0000ÿYYYÿ\u0095\u0095\u0095ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0091\u0091\u0091ÿ\u009b\u009b\u009bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿCCCÿÿÿÿÿîîîÿ\u008c\u008c\u008cÿ¿¿¿ÿVVVÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÓÓÓÿXXXÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ333ÿÿÿÿÿÿÿÿÿüýþÿÿÿÿÿÀÀÀÿ@@@ÿ\u0002\u0002\u0002ÿ\u0000\u0000\u0000ÿ\u001b\u001b\u001bÿûûûÿ\u0017\u0017\u0017ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿxxxÿÿÿÿÿÿÿÿÿÒáîÿ~©ÎÿàêóÿÿÿÿÿÔÔÔÿmmmÿ\u0084\u0084\u0084ÿÓÓÓÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ½½½ÿÿÿÿÿÿÿÿÿþþþÿf\u009aÅÿ=\u007f¶ÿ\u0082¬Ðÿäíõÿÿÿÿÿÿÿÿÿåååÿ---ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\f\f\fÿöööÿÿÿÿÿÿÿÿÿÿÿÿÿâìôÿM\u0089¼ÿ:}µÿ>\u0080¶ÿ\u0087°Òÿçïöÿÿÿÿÿþþþÿ¼¼¼ÿOOOÿ\u0003\u0003\u0003ÿJJJÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿëòøÿ\u008c³ÔÿV\u0090ÀÿP\u008c½ÿw¥Ìÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿæææÿÿÿÿÿ");
   public static final ByteBuffer LWJGLIcon32x32 = loadIcon("ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúüýÿËÝìÿ\u0093·Öÿo Éÿ\\\u0093Âÿ`\u0096Ãÿz§Íÿ¬ÈàÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüýþÿµÎãÿZ\u0092Áÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿE\u0085¹ÿ¡ÁÜÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüüüÿâêñÿ¸Ïãÿ®Éàÿ£ÂÜÿ\u0098ºØÿ\u008c³Óÿ\u0081¬Ïÿn\u009fÈÿ=\u007f¶ÿ:}µÿ:}µÿ:}µÿr¢ÊÿõøûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿØØØÿ111ÿ$$$ÿ111ÿ@@@ÿRRRÿeeeÿtttÿ\u008f\u008f\u008fÿ÷øøÿ¬Èßÿ;}µÿ:}µÿ:}µÿ:}µÿy§Íÿüýþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿhhhÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ¶¶¶ÿþþþÿ\u0086®Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ®ÊáÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÓâîÿáêòÿ(((ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿÞÞÞÿÿÿÿÿõøûÿ[\u0092Áÿ:}µÿ:}µÿ:}µÿH\u0086ºÿôøûÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿìóøÿd\u0099Åÿ×ÙÛÿ\u0005\u0005\u0005ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ$$$ÿþþþÿÿÿÿÿÿÿÿÿÀÕçÿ9|µÿ:}µÿ:}µÿ:}µÿ«Èàÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿÿx¦Ìÿ{§Íÿ\u009e\u009e\u009eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿeeeÿÿÿÿÿÿÿÿÿÿÿÿÿâìôÿ7{´ÿ:}µÿ:}µÿ:}µÿf\u009aÅÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÃ×èÿ9}µÿ²ÌáÿXXXÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ©©©ÿÿÿÿÿÿÿÿÿÿÿÿÿ¼Òåÿ:}µÿ:}µÿ:}µÿ:}µÿ@\u0081·ÿîôùÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúüýÿZ\u0092Áÿ=\u007f¶ÿÝåíÿ\u001c\u001c\u001cÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0007\u0007\u0007ÿçççÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0085®Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ9}µÿÌÞìÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÿÿÿÿÿÿÿÿÿÿÿÿºÒåÿ:}µÿW\u0090¿ÿÐÑÑÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ333ÿýýýÿÿÿÿÿÿÿÿÿûüýÿP\u008b½ÿ:}µÿ:}µÿ:}µÿ:}µÿ9}µÿ±ÌâÿÿÿÿÿÿÿÿÿÿÿÿÿÊÊÊÿ777ÿaaaÿ¢¢¢ÿÝÝÝÿäìóÿ±Ëáÿ´Íâÿæææÿ###ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿrrrÿÿÿÿÿÿÿÿÿÿÿÿÿØåðÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ ÀÛÿÿÿÿÿÿÿÿÿÿÿÿÿfffÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0006\u0006\u0006ÿ'''ÿfffÿÔÔÔÿÿÿÿÿöööÿÐÐÐÿ\u0097\u0097\u0097ÿ^^^ÿ'''ÿ\u0004\u0004\u0004ÿ\u0000\u0000\u0000ÿ\u0003\u0003\u0003ÿÀÀÀÿÿÿÿÿÿÿÿÿÿÿÿÿ¢ÁÛÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ\u009e¿Úÿÿÿÿÿÿÿÿÿûûûÿ%%%ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\\\\\\ÿÿÿÿÿêêêÿ\u008f\u008f\u008fÿµµµÿéééÿýýýÿçççÿ²²²ÿ½½½ÿþþþÿÿÿÿÿÿÿÿÿÿÿÿÿk\u009dÇÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ¡ÁÜÿÿÿÿÿÿÿÿÿÛÛÛÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0083\u0083\u0083ÿÿÿÿÿ___ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u000b\u000b\u000bÿ777ÿvvvÿ···ÿðððÿÿÿÿÿÿÿÿÿÿÿÿÿðõùÿK\u0088»ÿ=\u007f¶ÿ9|µÿ:}µÿ:}µÿ:}µÿ:}µÿ²Ìâÿÿÿÿÿÿÿÿÿ\u009a\u009a\u009aÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÅÅÅÿ÷÷÷ÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0007\u0007\u0007ÿ<<<ÿßßßÿÿÿÿÿûüýÿüýþÿó÷úÿÌÝëÿ\u009e¾Úÿr¡ÉÿL\u0089»ÿ:}µÿÉÜëÿÿÿÿÿÿÿÿÿVVVÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u000f\u000f\u000fÿùùùÿÑÑÑÿ\u0003\u0003\u0003ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u008e\u008e\u008eÿÿÿÿÿùùùÿ\u0084\u0084\u0084ÿpppÿ°°°ÿêêêÿÿÿÿÿùûüÿÜèòÿöùüÿÿÿÿÿÿÿÿÿ\u0015\u0015\u0015ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿNNNÿÿÿÿÿ\u0091\u0091\u0091ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ»»»ÿÿÿÿÿ\u009e\u009e\u009eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0004\u0004\u0004ÿ///ÿpppÿ°°°ÿæææÿþþþÿÿÿÿÿ999ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0090\u0090\u0090ÿÿÿÿÿMMMÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0010\u0010\u0010ÿðððÿÿÿÿÿZZZÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\t\t\tÿ222ÿ±±±ÿöööÿ¡¡¡ÿ555ÿ\u0002\u0002\u0002ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0002\u0002\u0002ÿÑÑÑÿõõõÿ\u0013\u0013\u0013ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿEEEÿþþþÿøøøÿ\u001d\u001d\u001dÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ+++ÿÿÿÿÿÿÿÿÿüüüÿ¾¾¾ÿPPPÿ\u0005\u0005\u0005ÿ%%%ÿùùùÿÂÂÂÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0086\u0086\u0086ÿÿÿÿÿÒÒÒÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿCCCÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÜÜÜÿàààÿÿÿÿÿ\u0095\u0095\u0095ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿÈÈÈÿÿÿÿÿ\u008e\u008e\u008eÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0088\u0088\u0088ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿßßßÿ)))ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0018\u0018\u0018ÿõõõÿÿÿÿÿJJJÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿÏÏÏÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿñöúÿÿÿÿÿÿÿÿÿÿÿÿÿùùùÿµµµÿKKKÿ\u0006\u0006\u0006ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿRRRÿÿÿÿÿøøøÿ\u0010\u0010\u0010ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u001c\u001c\u001cÿøøøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u0086¯Ñÿ\u0090µÕÿêñ÷ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÛÛÛÿxxxÿ\u001b\u001b\u001bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0096\u0096\u0096ÿÿÿÿÿÆÆÆÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿZZZÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÃØéÿ:}µÿC\u0083¸ÿ\u0094¸Öÿíóøÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿôôôÿ§§§ÿ\u0085\u0085\u0085ÿôôôÿÿÿÿÿ\u0086\u0086\u0086ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u009d\u009d\u009dÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúûýÿ]\u0094Âÿ:}µÿ:}µÿF\u0085¹ÿ\u0098»Øÿïôùÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u009b\u009b\u009bÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0005\u0005\u0005ÿÝÝÝÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÅÙéÿ;~¶ÿ:}µÿ:}µÿ:}µÿH\u0086ºÿ\u009e¾Úÿòöúÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿûûûÿ\u008e\u008e\u008eÿ%%%ÿ\u0001\u0001\u0001ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ,,,ÿüüüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ\u008fµÕÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿJ\u0087»ÿ£ÂÜÿó÷úÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿúúúÿ°°°ÿEEEÿ\u0004\u0004\u0004ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿ\u0000\u0000\u0000ÿnnnÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿüýþÿ\u0085¯Ñÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿM\u0089¼ÿ¨ÅÞÿöùüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþþÿÒÒÒÿhhhÿ\u000e\u000e\u000eÿ\u0000\u0000\u0000ÿ\u0001\u0001\u0001ÿ¸¸¸ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþþÿÿ±ËâÿL\u0089¼ÿ9}µÿ:}µÿ:}µÿ:}µÿ:}µÿ:}µÿM\u0089¼ÿ¿Ôçÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿìììÿ\u0093\u0093\u0093ÿ\u009b\u009b\u009bÿýýýÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿó÷úÿµÎãÿ\u0081¬Ðÿe\u0099Åÿa\u0097Äÿl\u009eÈÿ\u008fµÕÿÅÙéÿ÷úüÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ");
   public static final boolean DEBUG = getPrivilegedBoolean("org.lwjgl.util.Debug");
   public static final boolean CHECKS = !getPrivilegedBoolean("org.lwjgl.util.NoChecks");
   private static final int PLATFORM;

   private static ByteBuffer loadIcon(String var0) {
      int var1 = var0.length();
      ByteBuffer var2 = BufferUtils.createByteBuffer(var1);

      for(int var3 = 0; var3 < var1; ++var3) {
         var2.put(var3, (byte)var0.charAt(var3));
      }

      return var2.asReadOnlyBuffer();
   }

   public static int getPlatform() {
      return PLATFORM;
   }

   public static String getPlatformName() {
      switch(getPlatform()) {
      case 1:
         return "linux";
      case 2:
         return "macosx";
      case 3:
         return "windows";
      default:
         return "unknown";
      }
   }

   public static String[] getLibraryPaths(String var0, String var1, ClassLoader var2) {
      return getLibraryPaths(var0, new String[]{var1}, var2);
   }

   public static String[] getLibraryPaths(String var0, String[] var1, ClassLoader var2) {
      ArrayList var3 = new ArrayList();
      String var4 = getPathFromClassLoader(var0, var2);
      if (var4 != null) {
         log("getPathFromClassLoader: Path found: " + var4);
         var3.add(var4);
      }

      String[] var5 = var1;
      int var6 = var1.length;

      for(int var7 = 0; var7 < var6; ++var7) {
         String var8 = var5[var7];
         String var9 = getPathFromClassLoader("lwjgl", var2);
         if (var9 != null) {
            log("getPathFromClassLoader: Path found: " + var9);
            var3.add(var9.substring(0, var9.lastIndexOf(File.separator)) + File.separator + var8);
         }

         String var10 = getPrivilegedProperty("org.lwjgl.librarypath");
         if (var10 != null) {
            var3.add(var10 + File.separator + var8);
         }

         String var11 = getPrivilegedProperty("java.library.path");
         StringTokenizer var12 = new StringTokenizer(var11, File.pathSeparator);

         String var13;
         while(var12.hasMoreTokens()) {
            var13 = var12.nextToken();
            var3.add(var13 + File.separator + var8);
         }

         var13 = getPrivilegedProperty("user.dir");
         var3.add(var13 + File.separator + var8);
         var3.add(var8);
      }

      return (String[])var3.toArray(new String[var3.size()]);
   }

   static void execPrivileged(String[] var0) throws Exception {
      try {
         Process var1 = (Process)AccessController.doPrivileged(new PrivilegedExceptionAction(var0) {
            final String[] val$cmd_array;

            {
               this.val$cmd_array = var1;
            }

            public Process run() throws Exception {
               return Runtime.getRuntime().exec(this.val$cmd_array);
            }

            public Object run() throws Exception {
               return this.run();
            }
         });
         var1.getInputStream().close();
         var1.getOutputStream().close();
         var1.getErrorStream().close();
      } catch (PrivilegedActionException var2) {
         throw (Exception)var2.getCause();
      }
   }

   private static String getPrivilegedProperty(String var0) {
      return (String)AccessController.doPrivileged(new PrivilegedAction(var0) {
         final String val$property_name;

         {
            this.val$property_name = var1;
         }

         public String run() {
            return System.getProperty(this.val$property_name);
         }

         public Object run() {
            return this.run();
         }
      });
   }

   private static String getPathFromClassLoader(String var0, ClassLoader var1) {
      Class var2 = null;

      try {
         log("getPathFromClassLoader: searching for: " + var0);
         var2 = var1.getClass();

         while(var2 != null) {
            Class var3 = var2;

            try {
               return (String)AccessController.doPrivileged(new PrivilegedExceptionAction(var3, var1, var0) {
                  final Class val$clazz;
                  final ClassLoader val$classloader;
                  final String val$libname;

                  {
                     this.val$clazz = var1;
                     this.val$classloader = var2;
                     this.val$libname = var3;
                  }

                  public String run() throws Exception {
                     Method var1 = this.val$clazz.getDeclaredMethod("findLibrary", String.class);
                     var1.setAccessible(true);
                     String var2 = (String)var1.invoke(this.val$classloader, this.val$libname);
                     return var2;
                  }

                  public Object run() throws Exception {
                     return this.run();
                  }
               });
            } catch (PrivilegedActionException var5) {
               log("Failed to locate findLibrary method: " + var5.getCause());
               var2 = var2.getSuperclass();
            }
         }
      } catch (Exception var6) {
         log("Failure locating " + var6 + " using classloader:" + var2);
      }

      return null;
   }

   public static boolean getPrivilegedBoolean(String var0) {
      return (Boolean)AccessController.doPrivileged(new PrivilegedAction(var0) {
         final String val$property_name;

         {
            this.val$property_name = var1;
         }

         public Boolean run() {
            return Boolean.getBoolean(this.val$property_name);
         }

         public Object run() {
            return this.run();
         }
      });
   }

   public static Integer getPrivilegedInteger(String var0) {
      return (Integer)AccessController.doPrivileged(new PrivilegedAction(var0) {
         final String val$property_name;

         {
            this.val$property_name = var1;
         }

         public Integer run() {
            return Integer.getInteger(this.val$property_name);
         }

         public Object run() {
            return this.run();
         }
      });
   }

   public static Integer getPrivilegedInteger(String var0, int var1) {
      return (Integer)AccessController.doPrivileged(new PrivilegedAction(var0, var1) {
         final String val$property_name;
         final int val$default_val;

         {
            this.val$property_name = var1;
            this.val$default_val = var2;
         }

         public Integer run() {
            return Integer.getInteger(this.val$property_name, this.val$default_val);
         }

         public Object run() {
            return this.run();
         }
      });
   }

   public static void log(CharSequence var0) {
      if (DEBUG) {
         System.err.println("[LWJGL] " + var0);
      }

   }

   public static boolean isMacOSXEqualsOrBetterThan(int var0, int var1) {
      String var2 = getPrivilegedProperty("os.version");
      StringTokenizer var3 = new StringTokenizer(var2, ".");

      int var4;
      int var5;
      try {
         String var6 = var3.nextToken();
         String var7 = var3.nextToken();
         var4 = Integer.parseInt(var6);
         var5 = Integer.parseInt(var7);
      } catch (Exception var8) {
         log("Exception occurred while trying to determine OS version: " + var8);
         return false;
      }

      return var4 > var0 || var4 == var0 && var5 >= var1;
   }

   public static Map getClassTokens(LWJGLUtil.TokenFilter var0, Map var1, Class... var2) {
      return getClassTokens(var0, var1, (Iterable)Arrays.asList(var2));
   }

   public static Map getClassTokens(LWJGLUtil.TokenFilter var0, Map var1, Iterable var2) {
      if (var1 == null) {
         var1 = new HashMap();
      }

      boolean var3 = true;
      Iterator var4 = var2.iterator();

      while(var4.hasNext()) {
         Class var5 = (Class)var4.next();
         Field[] var6 = var5.getDeclaredFields();
         int var7 = var6.length;

         for(int var8 = 0; var8 < var7; ++var8) {
            Field var9 = var6[var8];
            if ((var9.getModifiers() & 25) == 25 && var9.getType() == Integer.TYPE) {
               try {
                  int var10 = var9.getInt((Object)null);
                  if (var0 == null || var0.accept(var9, var10)) {
                     if (((Map)var1).containsKey(var10)) {
                        ((Map)var1).put(var10, toHexString(var10));
                     } else {
                        ((Map)var1).put(var10, var9.getName());
                     }
                  }
               } catch (IllegalAccessException var11) {
               }
            }
         }
      }

      return (Map)var1;
   }

   public static String toHexString(int var0) {
      return "0x" + Integer.toHexString(var0).toUpperCase();
   }

   static {
      String var0 = getPrivilegedProperty("os.name");
      if (var0.startsWith("Windows")) {
         PLATFORM = 3;
      } else if (!var0.startsWith("Linux") && !var0.startsWith("FreeBSD") && !var0.startsWith("SunOS") && !var0.startsWith("Unix")) {
         if (!var0.startsWith("Mac OS X") && !var0.startsWith("Darwin")) {
            throw new LinkageError("Unknown platform: " + var0);
         }

         PLATFORM = 2;
      } else {
         PLATFORM = 1;
      }

   }

   public interface TokenFilter {
      boolean accept(Field var1, int var2);
   }
}
